//
// 9*9乘法表，用于理解数组和指针关系
// Created by colorcard on 2024/9/12.
//

#include<stdio.h>

int main(){
    for(unsigned int __[2]={4294967295}; *__>=4294967286; (*__)--)//当__[0]>=4294967287时递减1

        for(*(int *)(__+0x04)=1;*(int *)(__+0x04)<=(int)(~(*__));//初始__[1]为1，此乘数小于等于__[0]的按位取反值时继续循环

            (int)(*(__+0x04))++)//__[1]加1

            printf("%d%c%d%c%d%c",
                   (int)(~(*__)),//对于__[]按位取反
                   (char)((0x06<<0x03)-0x06),*(__+0x04),//*
                   (char)(-0x03+(0x08<<0x03)),//=
                   (*(__+0x04))*(int)(~(*__)),//乘数的结果
                   (*(__+0x04)==(int)(~(*__))?(char)10:(char)32));//如果两乘数相等则输入空格，否则则换行
}